Revit 2026 API

# XYZBasisY Property

---

The basis of the Y axis.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static XYZ BasisY { get; }
```
```vb
Public Shared ReadOnly Property BasisY As XYZ
	Get
```
```cpp
public:
static property XYZ^ BasisY {
	XYZ^ get ();
}
```
```fsharp
static member BasisY : XYZ with get
```

#### Property Value

XYZ

The basis of the Y axis is the vector (0,1,0), the unit vector on the Y axis.

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace